{
  "tools": [
    {
      "name": "Sonosthesia-Hub",
      "description": "The hub is the central building block which allows all the other software components to talk to each other. It is a large node.js module which offers a lot of functionality with a simple API. This includes a TCP server which understands the JSON messages defined by Sonosthesia, persistence by writing configurations to files, mapping tools and much more.",
      "link": "https://github.com/jbat100/sonosthesia-hub/tree/develop",
      "state": "Alpha",
      "image": ""
    },
    {
      "name": "Sonosthesia-Unity",
      "description": "A set of Unity C# providing a number of extensions for the Sonosthesia project. This includes network connectivity such as an OSC control message receiver and sender (client/server), a TCP client for the Sonosthesia-Hub. scene manipulators driven by control messages and control message generators driven by scene dynamics. Unity editor scripts are also provided to facilitate scene setup and configuration, and the understanding of Sonosthesia's cross-modal mapping concepts.",
      "link": "https://github.com/jbat100/sonosthesia-unity/tree/develop",
      "state": "Alpha",
      "image": ""
    },
    {
      "name": "Sonosthesia-Analyser",
      "description": "VST/AU plugin to analyse sound and broadcast them to the Sonosthesia-Hub. Alternatively, you can map the results to channels and parameters, and broadcast them to OSC control targets (host/port combination). This project is derived from Adam Stark's Sound Analyser. Sound analysis can be performed using a variety of algorithms from the Gist library and others, additional analysis options are planned. You can use the sound going through any channel or bus in your DAW as a controller for anything that understands Sonosthesia protocols, anywhere on your local network.",
      "link": "https://github.com/jbat100/sonosthesia-analyser/tree/develop",
      "state": "Beta",
      "image": "../images/analyser2.png"
    },
    {
      "name": "Sonosthesia-Relay",
      "description": "VST/AU plugin to intercept MIDI messages and automation data and broadcast to the Sonosthesia-Hub. Alternatively, you can map the results to control channels and parameters and broadcast them to OSC control targets (host/port combination). There are different options to translate MIDI data to control data to allow for maximum flexibility. You can forward all your DAW's MIDI and automation data as controllers for anything that understands Sonosthesia protocols, anywhere on the network.",
      "link": "https://github.com/jbat100/sonosthesia-relay/tree/develop",
      "state": "Beta",
      "image": "../images/relay2.png"
    }
  ]
}